class RuleString {
  final appRule = '''
서비스 이용약관 

제 1 장 총칙 


제 1 조 (목적) 

본 약관은 주식회사 하야트(이하 “회사”)가 제공하는 “서비스”의 이용과 관련하여 회사와 회원과의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다. 


제 2 조 (정의) 

① 본 약관에서 사용하는 용어의 의미는 다음과 같습니다. 

• “서비스”란 그 전후 문맥에 따라 회원이 회원의 단말기(스마트폰, 태블릿 PC 등 각종 유무선 장치를 포함)로 이용할 수 있는 “인지케어” 애플리케이션 또는 그 애플리케이션을 통해서 제공하는 본 약관 제 7 조의 서비스를 말합니다. 
• “회원”이란 서비스에 접속하여 본 약관에 따라 회사와 이용계약을 체결한 가입자 본인을 말합니다. 

② 본 약관에서 사용하는 용어 중 본 조에서 정하지 아니한 것은 서비스 화면상 안내, 운영정책 및 관련 법령에서 정하는 바에 따르며, 그 외에는 일반 관례에 따릅니다. 


제 3 조 (약관의 효력과 변경) 

① 본 약관은 서비스를 이용하고자 하는 모든 이용자에 대하여 그 효력을 발생합니다. 

② 회사는 본 약관의 내용을 회원이 쉽게 확인할 수 있도록 서비스 초기 화면에 공지합니다. 

③ 회사는 『약관의 규제에 관한 법률』, 『정보통신망 이용촉진 및 정보보호 등에 관한 법률』, 『개인정보보호법』 등 관련 법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다. 

④ 회사는 필요하다고 인정되면 본 약관을 변경할 수 있으며, 회사가 약관을 개정할 경우에는 기존약관과 개정약관 및 개정약관의 적용일자와 개정사유를 명시하여 현행약관과 함께 그 적용일자 7 일 전부터 적용일 이후 상당한 기간 동안 공지합니다.
다만, 개정 내용이 회원에게 불리한 경우에는 그 적용일자 30 일 전부터 적용일 이후 상당한 기간 동안 각각 이를 서비스 홈페이지에 게시하여 고지합니다. 

⑤ 회원이 개정약관의 내용에 명시적으로 거부의 의사표시를 한 경우 회사는 해당 회원에 대하여 개정약관의 내용을 적용할 수 없으며, 이 경우 회원과 회사는 이용계약을 해지할 수 있습니다. 회원이 별도의 거부의사를 표시하지 아니하면 개정된 약관에 동의한 것으로 간주됩니다. 

⑥ 회원은 서비스 화면에서 본 약관의 내용을 확인할 의무가 있으며, 개정된 약관에 동의한 회원이 약관의 변경으로 인하여 입은 피해 및 회원의 확인 소홀로 개정된 약관의 내용을 알지 못해 발생하는 피해에 대해서 회사는 책임지지 않습니다. 


제 4 조 (약관 외 준칙) 

① 회사는 필요한 경우 특정 서비스에 관하여 별도로 운영정책을 정하여 운영할 수 있으며, 운영정책은 동 약관에 보충적으로 적용됩니다. 

② 본 약관에 명시되지 않은 사항은 운영정책 및 『정보통신망 이용촉진 및 정보보호 등에 관한 법률』 등 관련 법령의 규정 또는 일반 관례에 따릅니다. 


제 5 조 (회원에 대한 통지) 

① 회사가 회원에 대한 통지를 하는 경우 본 약관에 별도 규정이 없는 한 회원의 전자우편 또는 서비스 내 전자쪽지 등으로 할 수 있습니다. 

② 회사는 회원 전체에 대한 통지의 경우 7 일 이상 서비스 화면에 게시함으로써 제 1 항의 통지에 갈음할 수 있습니다. 


제 2 장 이용계약 

제 6 조 (이용계약 체결) 

① 서비스 이용계약은 회원이 되고자 하는 자(이하 “가입신청인”)가 “개인정보 수집·이용 동의” 및 본 약관에 동의하고 가입을 신청한 다음, 회사가 이러한 신청에 대하여 승낙함으로써 체결됩니다. 

② 가입신청인이 서비스를 이용하기 위해서는 회사가 요청하는 정보를 정확하게 기재해야 하며, 기재 내용에 허위, 누락, 오기 등이 있는 경우 이로 인한 불이익 및 법적 책임은 가입신청인에게 있습니다. 

③ 가입신청인이 이전에 회원자격을 상실한 적이 있는 경우, 허위의 명의 또는 타인의 명의를 이용하는 등 회사가 요청하는 정보를 정확하게 기재하지 않은 경우, 자신 또는 타인의 영리 목적 등 부당한 회원 가입 신청임이 확인된 경우, 회원이 본 서비스 약관을 위반한 사실이 있음이 확인된 경우, 기타 승낙이 불가능한 합리적인 사유가 있는 경우 승낙이 거부될 수 있습니다. 이러한 사유가 있음에도 불구하고 회원 가입이 된 경우 회사는 해당 회원과의 이용계약을 해지하고 회원을 탈퇴 처리할 수 있습니다. 

④ 회사는 서비스 관련 설비 등의 여유 기타 기술상 또는 업무상의 이유로 승낙을 유보할 수 있습니다. 

⑤ 회사는 제 3 항에 따라 회원가입신청의 승낙을 하지 아니하거나 회원 탈퇴 처리를 하는 경우 및 제 4 항에 따라 회원가입신청의 승낙을 유보한 경우 가입신청인에게 알려드립니다. 



제 3 장 서비스 

제 7 조 (서비스 내용) 

① 회사는 회원에게 무료로 다음 각 호의 서비스를 제공합니다. 단, 회원이 자신의 휴대전화를 이용하여 서비스 이용 시 발생하는 데이터 통신요금은 회원의 휴대전화의 이동통신사에서 요금정책에 따라 회원에게 별도로 과금할 수 있습니다. 현 시점의 과학기술과 민간업체가 수집할 수 있는 정보의 수준에 따라 일부 서비스의 제공은 제한될 수도 있습니다.

1. ’일기’ 서비스: 회원에게 회원의 걸음수, 문제 풀기, 감정 선택, 일기 작성, 일기 공유를 통한 소통 등의 인지 건강 관리를 제공해주는 서비스

2. ‘인지 검사’ 서비스: 회원에게 온라인 치매 검사, 우울 척도 검사 등의 정신 건강 시험을 온라인으로 진행할 수 있도록 해주는 서비스

3. ‘행사’ 서비스: 회원이 인지케어 및 제휴 기관에서 제공하는 다양한 행사에 참여하여 인지 건강을 관리하고 보상을 받는 서비스

4. ‘AI 대화하기’ 서비스: 손쉽게 챗GPT와 말로 대화하는 서비스

5. 기타 위 각 호를 위하여 필요한 부수적인 서비스 및 인지 건강을 위한 즐거운 활동 서비스


② 회사는 제 1 항의 서비스 외에도 서비스를 추가 개발하여 회원에게 제공할 수 있습니다. 

③ 회사는 서비스에 회사 또는 회사와 제휴한 제 3 자의 광고를 게재할 수 있습니다. 


제 8 조 (서비스 중지, 변경 및 종료) 

① 회사는 기술상 또는 업무상의 필요에 따라 서비스의 전부 또는 일부를 중지, 변경 또는 종료할 수 있으며, 이에 대하여 약관에 다른 규정이 없는 한 회원에게 별도의 보상을 하는 등 일체의 책임을 부담하지 않습니다. 

② 서비스를 중지 또는 변경하는 경우, 중지사유 및 중지 일자, 변경사유 및 변경 일자, 변경 내용을 중지 또는 변경 14 일 전에 서비스 초기 화면에 공지합니다. 다만, 사전에 공지할 수 없는 부득이한 사정이 있는 경우에는 사후에 지체 없이 이를 공지할 수 있습니다. 

③ 서비스를 종료하는 경우, 종료사유 및 종료 일자를 종료 30 일 전에 서비스 초기 화면에 공지합니다. 다만, 사전에 공지할 수 없는 부득이한 사정이 있는 경우에는 사후에 지체 없이 이를 공지할 수 있습니다. 

④ 서비스 종료 공지일부터 종료일까지 서비스의 일부가 제한될 수 있습니다.


제 9 조 (저작권 등의 귀속 등) 

① “인지케어” 애플리케이션, 서비스 또는 기타 회사가 운영하는 정보통신망에 게시된 내용에 대한 저작권은 회원의 작성 게시물을 제외하고는 모두 회사에게 귀속됩니다. 

② 회사의 상표, 로고, 제공하는 서비스 및 광고내용 등에 관한 지식재산권 등의 권리는 회사에 귀속합니다. 

③ 회원이 서비스에 게시한 게시물의 저작권 및 책임은 회원 본인에게 있으며, 회원이 서비스에 게시한 게시물로 파생되는 문제에 대해서는 전적으로 해당 회원에게 책임이 있습니다. 

④ 회원은 회사의 사전 승낙 없이 자신의 작성 게시물을 제외한 타인 작성 게시물의 내용을 복제, 배포, 전송, 사용하거나 제 3 자로 하여금 사용하게 해서는 아니 됩니다. 

⑤ 회원의 작성 게시물은 회사의 서비스 홍보, 프로모션, 마케팅, 판촉 등을 위하여 임의의 정보통신망에 복제, 배포, 전송, 게시, 노출될 수 있으며, 본질적인 내용에 변경을 가하지 않는 범위 내에서 수정, 편집될 수 있습니다. 


제 10 조 ("게시물의 관리) 

① 회원의 "게시물"이 『정보통신망법』 및 『저작권법』 등 관련법령에 위반되는 내용을 포함하는 경우, 또는 타인의 권리를 침해하여 권리자의 요청이 있는 경우 회사는 해당 "게시물"의 삭제•게시중단•임시조치 등 필요한 조치를 취하여야 합니다. 

② 제 1 항의 경우 권리를 침해받은 자는 help@hayat.kr 으로 연락하여 침해사실을 소명하고 게시물의 삭제 또는 반박내용의 게재를 요청할 수 있습니다. 위와 같은 요청을 받은 회사는 지체 없이 필요한 조치를 취한 후 즉시 신청인 및 게시물 게시자에게 알리고 필요한 조치를 한 사실을 해당 게시판에 공시하는 등의 방법으로 회원이 알 수 있도록 합니다. 

③ 회사는 제 1 항에 따른 권리를 침해받은 자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련법령에 위반되는 경우에는 관련법령에 따라 해당 "게시물"에 대해 삭제•게시중단•임시조치 등 필요한 조치를 취할 수 있습니다. 



제 4 장 계약당사자의 의무


제 11 조 (회사의 의무) 

① 회사는 관련 법령과 본 약관이 금지하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 노력할 의무가 있습니다. 

② 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보 보호를 위한 보안시스템을 갖추어야 하며, 개인정보처리방침을 회원이 늘 확인할 수 있도록 서비스 화면에 공시하고 이를 준수합니다. 

③ 회사는 서비스 이용과 관련한 회원의 의견이나 불만사항 등이 정당하다고 인정할 경우 이를 처리하여야 합니다. 처리된 결과는 서비스를 통하여 회원에게 통보됩니다. 


제 12 조 (회원의 의무) 

① 회원은 서비스 이용과 관련하여 다음 각 호에 해당되는 행위를 하여서는 아니 됩니다. 

1. 서비스 이용 관련 제반 신청 및 변경행위 시 허위내용의 등록 
2. 서비스 내 게시된 각종 정보의 무단 변경, 삭제 등 훼손 
3. 일체의 가공행위를 통해 서비스를 분해, 변경, 모방하는 행위 
4. 회사 기타 제 3 자의 지식재산권을 포함하여 권리를 침해하는 행위 
5. 타인의 개인정보를 수집하거나 명예를 훼손하는 행위 
6. 회사의 동의 없이 광고를 전송하거나 외설, 폭력적인 정보 등을 노출하는 행위 
7. 타인의 개인정보 또는 모바일 기기를 도용하는 행위 
8. 회사가 안내하는 서비스 이용방법에 의하지 아니하고 비정상적인 방법으로 서비스를 이용하거나 회사의 시스템에 접근하는 행위 
9. 회사의 원활한 서비스 제공에 지장을 주는 것으로 판단되는 행위 
10.자신 또는 타인의 영리 목적으로 서비스를 이용하는 행위 
11.회원 가입시 개인정보를 허위로 작성하는 행위 
12.타인의 서비스 이용을 방해하는 등 전자거래질서를 위협하는 행위 
13.서비스 외에서 회사, 운영자, 임직원 등을 사칭하는 행위 
14.무단으로 회사의 클라이언트 프로그램을 변경하거나 서버를 해킹하는 등 시스템을 위협하는 행위 
15.허위사실 유포, 위계기타 방법으로 회사의 명예 또는 신용을 훼손하거나 업무를 방해하는 행위 
16.기타 약관상의 의무를 불이행하는 행위 17.기타 관계 법령에 위배되는 행위


② 회사는 회원의 의무를 위반한 회원에 대하여 회사의 판단에 따라 다음 각 호에 해당되는 조치를 할 수 있습니다. 

1. 사전 통보함 없이 임의로 관련 게시물 삭제 
2. 일정 기간 동안 서비스 이용 정지 
3. 회사가 입은 손해 전액에 대한 배상 청구 
4. 서비스 이용계약의 해지 및 회원 탈퇴 처리 

③ 회사가 전 항에 정한 조치를 할 경우, 회사는 14 일 전에 회원에게 그 사유를 밝혀 통보하며, 통보를 한 날로부터 14 일이 도과한 시점에서 그 효력이 발생합니다. 단, 회원의 연락이 두절되거나 긴급을 요하는 것과 같이 부득이한 경우 선 조치 후 사후 통보할 수 있습니다. 


제 13 조 (회원정보의 관리) 

① 회원은 회원 가입 신청 시 또는 회사의 본인 인증 요청 시에 기입한 사항이 변경되었을 경우에는 즉시 서비스에서 변경사항을 최신의 정보로 수정하여야 합니다. 

② 변경된 사항을 반영하지 않음으로 인하여 발생하는 손해 및 법적 책임은 당해 회원이 전적으로 부담하며, 회사는 이에 대하여 책임을 지지 않습니다. 

③ 회사는 회사의 귀책사유 없는 회원정보의 유출, 양도, 대여로 인한 손실이나 손해에 대하여 아무런 책임을 지지 않습니다. 

④ 회원은 회원의 가입정보가 도용되거나 제 3 자가 무단 사용하고 있음을 인지한 경우, 지체 없이 회사에 통지하여야 하고, 회사의 안내가 있는 경우에는 그에 따라야 합니다. 회원이 회사에 이를 지체 없이 통지하지 않거나 통지한 경우에도 회사의 안내에 따르지 않은 경우에는 도용 또는 제 3 자의 무단 사용으로 인한 손실이나 손해에 대하여 회사는 아무런 책임을 지지 않습니다. 

⑤ 계정 관리 책임은 회원 개인에게 있으며, 회원은 어떠한 경우에도 본인의 계정을 타인에게 양도하거나 타인으로 하여금 이용하게 하거나 타인의 서비스 이용을 위해서 사용하면 안 됩니다. 



제 5 장 계약해지 및 이용제한

제 14 조 (회원의 계약해지, 이용 중지요청) 

① 회원은 언제든지 서비스 내 정해진 절차를 거쳐 서비스 이용계약 해지 또는 이용 중지를 신청할 수 있으며 회사는 이를 즉시 처리합니다. 

② 제 12 조 제 1 항 또는 제 12 조 제 2 항 제 4 호에 의한 해지의 경우, 회원의 개인정보, 민감정보를 포함한 모든 데이터는 회사의 개인정보취급방침에 따라 파기됩니다. 

③ 해지로 인하여 회원에게 발생하는 손해에 대하여 회사는 책임지지 않습니다. 



제 6 장 손해배상 등 

제 15 조 (분쟁 해결) 

① 회사는 서비스 이용과 관련한 회원의 의견이나 불만사항을 신속하게 처리합니다. 단, 신속한 처리가 곤란한 경우에는 그 사유와 처리일정을 통보하여 드립니다. 

② 회원 간 또는 회원과 제 3 자 간 발생한 분쟁에 대하여 회사는 합리적인 범위 내에서 이를 조정할 수 있습니다. 

③ 회사가 분쟁조정을 하는 경우 회사는 제 3 자의 입장에서 공정하게 조정에 임하며, 회원은 신의성실원칙에 따라 성실히 응하여야 합니다. 


제 16 조 (손해배상) 

① 회사는 서비스 이용과 관련하여 회원에게 어떤 손해가 발생하더라도 회사가 고의로 행한 범죄행위를 제외하고 이에 대하여 책임을 지지 않습니다. 

② 회원이 서비스를 이용함에 있어 행한 불법행위로 인하여 회사가 당해 이용자 이외의 제 3 자로부터 손해배상청구, 소송을 비롯한 각종의 이의제기를 받는 경우 당해 회원은 회사의 면책을 위하여 노력하여야 하며, 만일 회사가 면책되지 못한 경우에는 당해 회원은 그로 인하여 회사에 발생한 모든 손해를 배상하여야 합니다. 


제 17 조 (면책사항) 

① 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.

② 회사는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을 지지 않습니다. 

③ 회사는 무료로 제공되는 서비스 이용과 관련하여 관련법령에 특별한 규정이 없는 한 책임을 지지 않습니다. 

④ 회사는 회원과 회원 사이에 발생한 분쟁에 관하여 책임을 지지 않습니다. 


제 18 조 (준거법 및 관할법원) 

① 회사와 회원 간에 제기된 법적 분쟁은 대한민국 법을 준거법으로 합니다.

② 본 약관의 해석 또는 본 약관과 관련된 법적 분쟁에 대하여 제기하는 소송은 서울중앙지방법원을 관할법원으로 합니다. 




부칙 제 1 조 (시행일) 

본 약관은 2024 년 11 월 30 일 부터 시행합니다.


''';

  final personalInfo = '''
개인정보처리방침

제1조 (개인정보의 처리목적, 수집 항목, 보유 및 이용기간)

하야트 주식회사(이하 “회사”)는 정보주체의 자유와 권리 보호를 위해 ⎾개인정보 보호법⏌ 및 관계 법령이 정한 바를 준수하여, 적법하게 개인정보를 처리하고 안전하게 관리하고 있습니다. 이에 ⎾개인정보 보호법⏌ 제 30조에 따라 정보주체에게 개인정보 처리에 관한 절차 및 기준을 안내하고, 이와 관련한 고충을 신속하고 원할하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립・공개합니다.

수집된 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며 수집 목적이 변경될 경우 사전에 알리고 동의를 받을 예정입니다.

회원가입 및 관리: 회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별 인증, 회원자격 유지 관리, 서비스 부정이용 방지 등을 목적으로 개인정보를 처리합니다.


제2조 (개인정보 제3자 제공)

① 회사는 정보주체의 개인정보를 개인정보의 처리 목적에서 명시한 범위 내에서만 처리하며, 정보주체의 동의, 법률의 특별한 규정 등 ⎾개인정보 보호법⏌제 17조 및 제18조에 해당하는 경우만 개인정보를 제3자에게 제공하고 그 외에는 정보주체의 개인정보를 제3자에게 제공하지 않습니다.

② 회사는 원활한 서비스 제공을 위해 다음의 경우 정보주체의 동의를 얻어 필요 최소한의 범위로만 제공합니다.


제공 받는 자

1. 다른 회원
- 목적: 일기 공유 / 활동 점수 비교 / 행사 참여 점수 비교
- 제공 항목:  닉네임, 휴대전화번호, 성별, 나이, 거주지역, 프로필 사진, 걸음수, 일기, 치매 검사 결과, 행사 참여 정보 
- 보유 및 이용 기간: 앱 탈퇴 시까지

2. 프로그램 개설자
- 목적: 회원의 치매 정보를 바탕으로 맞춤형 정신건강 서비스 제공 / 상품 발송
- 제공 항목:  닉네임, 휴대전화번호, 성별, 나이, 거주지역, 프로필 사진, 걸음수, 일기, 치매 검사 결과, 행사 참여 정보 
- 보유 및 이용 기간: 앱 탈퇴시 혹은 계약 종료 시까지

3. 관계기관
- 목적: 행사 안내 / 상품 발송
- 제공 항목:  닉네임, 휴대전화번호, 성별, 나이, 거주지역, 프로필 사진, 걸음수, 일기, 치매 검사 결과, 행사 참여 정보 
- 보유 및 이용 기간: 앱 탈퇴시 혹은 계약 종료 시까지


③ 회사는 근거법령에 의거하여 재난, 감염병, 급박한 생명・신체 위험을 초래하는 사건・사고 등의 긴급상황이 발생하는 경우 정보주체의 동의 없이 관계기관에 개인정보를 제공할 수 있습니다. 이 경우 회사는 필요한 최소한의 개인정보만을 제공하며, 목적과 다르게 제공하지 않겠습니다.


제3조 (개인정보 수집/이용/제공 거부 시 불이익)

회원은 개인정보 수집/이용/제3자 제공에 동의를 거부할 권리가 있습니다. 다만, 회원이 개인정보의 수집/이용/제공에 관한 동의를 거부할 경우 회원의 회원가입이 불가능합니다.


제4조 (개인정보의 파기 및 절차)

① 회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.

② 정보주체로부터 동의 받은 개인정보 보유기간이 경과하거나 처리 목적이 달성 되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.


제5조 (정보주체와 법정대리인의 권리•의무 및 행사 방법)

① 정보주체는 회사에 대해 언제든지 개인정보 열람・정정・삭제・처리 정지 요구 등의 권리를 행사할 수 있습니다.

② 회사는 정보주체 권리에 따른 열람의 요구, 정정・삭제의 요구, 처리 정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.


제5조 (고지)
본 개인정보처리방침의 내용 추가, 삭제 및 수정이 있을 경우 개정 최소 7일 전에 인지케어 앱을 통해 사전 공지할 것입니다.
- 시행일자: 2024년 11월 30일


''';
}
